app/controllers/admin/categories_controller.rb

  def index
    if params[:id].blank?
      @categories = Category.roots
    else
      @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1

  def create
    @category = Category.new(params.require(:category).permit!)
    if @category.save
---
INSERT INTO `categories` (`title`, `weight`, `created_at`, `updated_at`, `ancestry`) VALUES ('213', 11, '2020-06-06 08:17:57.782084', '2020-06-06 08:17:57.782084', '2')

  def update
    @category.attributes=params.require(:category).permit!

    if @category.save
---
UPDATE `categories` SET `categories`.`title` = '21', `categories`.`updated_at` = '2020-06-06 08:11:00.357349' WHERE `categories`.`id` = 1

  def destroy
    if @category.destroy
---
DELETE FROM `categories` WHERE `categories`.`id` = 1

  def find_category
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1