app/controllers/admin/product_images_controller.rb

INSERT INTO `product_images` (`product_id`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES (2, 'H930DS-Aurora-Black-128GB_Desk1_171009.jpg', 'image/jpeg', 45131, '2020-06-10 04:16:24', '2020-06-10 04:16:24.723041', '2020-06-10 04:16:24.723041')
---
    def create
      params[:images].each do |image|
        @product.product_images << ProductImage.new(image: image)

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 2 AND `product_images`.`id` = 2 LIMIT 1
DELETE FROM `product_images` WHERE `product_images`.`id` = 2
---
    def destroy
      @product_image = @product.product_images.find(params[:id])
      if @product_image.destroy

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 2 AND `product_images`.`id` = 3 LIMIT 1
UPDATE `product_images` SET `product_images`.`weight` = 12, `product_images`.`updated_at` = '2020-06-10 04:28:42.224426' WHERE `product_images`.`id` = 3
---
    def update
      @product_image = @product.product_images.find(params[:id])
      @product_image.weight = params[:weight]
      if @product_image.save

SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
---
    def find_product
      @product = Product.find params[:product_id]