app/controllers/admin/products_controller.rb

SELECT COUNT(*) FROM `products`
SELECT `products`.* FROM `products` ORDER BY id desc LIMIT 10 OFFSET 0
---
    def index
        @products = Product.page(params[:page] || 1).per_page(params[:per_page] || 10)
         .order("id desc")

INSERT INTO `products` (`category_id`, `title`, `status`, `amount`, `uuid`, `msrp`, `price`, `description`, `created_at`, `updated_at`) VALUES (2, '1341', 'on', 12, '0609WK50BX', 123.0, 21.0, '412', '2020-06-09 14:12:31.895838', '2020-06-09 14:12:31.895838')
---
    def create
        @product = Product.new(params.require(:product).permit!)
        @root_categories = Category.roots

        if @product.save

UPDATE `products` SET `products`.`title` = 'Iphone13', `products`.`updated_at` = '2020-06-09 14:18:41.747103' WHERE `products`.`id` = 1
---
    def update
        @product.attributes = params.require(:product).permit!
        @root_categories = Category.roots
        if @product.save

DELETE FROM `products` WHERE `products`.`id` = 1
---
    def destroy
        if @product.destroy

SELECT `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
    def find_product
      @product = Product.find(params[:id])