app/controllers/products_controller.rb

    def show
      fetch_home_data

      @product = Product.find(params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1