app/controllers/users_controller.rb

    def create
      @user = User.new(params.require(:user)
        .permit(:email, :password, :password_confirmation))

      if @user.save
---
INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`, `activation_state`, `activation_token`) VALUES ('1@qq.com', '$2a$10$Rvft32sDkKt9C5CooCppI.MGg00UHUpwzVDivRiv/cGG3Gr30r6G6', 'n9DR1DCDnpvCzs5KJhXx', '2020-06-02 07:58:36.887518', '2020-06-02 07:58:36.887518', 'pending', '_XnzXvQ1RoruHQvKHhDW')