app/models/category.rb

SELECT `categories`.* FROM `categories` WHERE `categories`.`ancestry` IS NULL ORDER BY weight desc
---
    def correct_ancestry
        self.ancestry = nil if self.ancestry.blank?